TwoPhaseFlow-master/run/benchmark/surfaceTension/curvatureCircle/curvature2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.05 0)
    (2 -0.05 0)
    (2 0.05 0)
    (0 0.05 0)
    (0 -0.05  2)
    (2 -0.05  2)
    (2 0.05  2)
    (0 0.05  2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 1 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    rim
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 4 7 3)
            (1 2 6 5)
            (0 3 2 1)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type empty;
        faces
        (
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
